{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
    "createdDateTime": "2025-02-20T16:45:30.6832831Z",
    "creationSource": null,
    "description": "CIS Microsoft Intune for Windows 11 Benchmark v 3.0.1 policies for Intune\nCIS Level 1\nWindows LAPS Policies",
    "lastModifiedDateTime": "2025-02-20T16:45:30.6832831Z",
    "name": "CIS Microsoft Intune for Windows 11 Benchmark v 3.0.1 - Windows LAPS",
    "platforms": "windows10",
    "priorityMetaData": null,
    "roleScopeTagIds": [
      "0"
    ],
    "settingCount": 5,
    "technologies": "mdm",
    "id": "74e5558d-f690-4a3d-bc83-461ff5893f3d",
    "templateReference": {
      "templateId": "adc46e5a-f4aa-4ff6-aeff-4f27bc525796_1",
      "templateFamily": "endpointSecurityAccountProtection",
      "templateDisplayName": "Local admin password solution (Windows LAPS)",
      "templateDisplayVersion": "Version 1"
    },
    "settings": [
      {
        "id": "0",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_laps_policies_backupdirectory",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "a3270f64-e493-499d-8900-90290f61ed8a"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_laps_policies_backupdirectory_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "4d90f03d-e14c-43c4-86da-681da96a2f92",
              "useTemplateDefault": false
            },
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "settingDefinitionId": "device_vendor_msft_laps_policies_passwordagedays_aad",
                "settingInstanceTemplateReference": null,
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                  "value": 28,
                  "settingValueTemplateReference": {
                    "settingValueTemplateId": "4d90f03d-e14c-43c4-86da-681da96a2f92",
                    "useTemplateDefault": false
                  }
                }
              }
            ]
          }
        }
      },
      {
        "id": "1",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_laps_policies_passwordcomplexity",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "8a7459e8-1d1c-458a-8906-7b27d216de52"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_laps_policies_passwordcomplexity_4",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "aa883ab5-625e-4e3b-b830-a37a4bb8ce01",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "2",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
          "settingDefinitionId": "device_vendor_msft_laps_policies_passwordlength",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "da7a1dbd-caf7-4341-ab63-ece6f994ff02"
          },
          "simpleSettingValue": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
            "value": 20,
            "settingValueTemplateReference": {
              "settingValueTemplateId": "d08f1266-5345-4f53-8ae1-4c20e6cb5ec9",
              "useTemplateDefault": false
            }
          }
        }
      },
      {
        "id": "3",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
          "settingDefinitionId": "device_vendor_msft_laps_policies_postauthenticationresetdelay",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "a9e21166-4055-4042-9372-efaf3ef41868"
          },
          "simpleSettingValue": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
            "value": 8,
            "settingValueTemplateReference": {
              "settingValueTemplateId": "0deb6aee-8dac-40c4-a9dd-c3718e5c1d52",
              "useTemplateDefault": false
            }
          }
        }
      },
      {
        "id": "4",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_laps_policies_postauthenticationactions",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "d9282eb1-d187-42ae-b366-7081f32dcfff"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_laps_policies_postauthenticationactions_3",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "68ff4f78-baa8-4b32-bf3d-5ad5566d8142",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      }
    ]
  }