{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
    "createdDateTime": "2025-02-26T17:26:00.8325858Z",
    "creationSource": null,
    "description": "CIS Microsoft Intune for Windows 11 Benchmark v 3.0.1 policies for Intune\nCIS Level 1",
    "lastModifiedDateTime": "2025-02-26T17:43:19.5847612Z",
    "name": "CIS Lvl 1 Microsoft Intune for Windows 11 Benchmark v 3.0.1 - User Configuration",
    "platforms": "windows10",
    "priorityMetaData": null,
    "roleScopeTagIds": [
      "0"
    ],
    "settingCount": 7,
    "technologies": "mdm",
    "id": "6ee32229-7af9-4731-b155-d55eccc2d5ac",
    "templateReference": {
      "templateId": "",
      "templateFamily": "none",
      "templateDisplayName": null,
      "templateDisplayVersion": null
    },
    "settings": [
      {
        "id": "0",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "user_vendor_msft_policy_config_admx_controlpaneldisplay_cpl_personalization_enablescreensaver",
          "settingInstanceTemplateReference": null,
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "value": "user_vendor_msft_policy_config_admx_controlpaneldisplay_cpl_personalization_enablescreensaver_1",
            "children": []
          }
        }
      },
      {
        "id": "1",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "user_vendor_msft_policy_config_admx_wpn_nolockscreentoastnotification",
          "settingInstanceTemplateReference": null,
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "value": "user_vendor_msft_policy_config_admx_wpn_nolockscreentoastnotification_1",
            "children": []
          }
        }
      },
      {
        "id": "2",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "user_vendor_msft_policy_config_attachmentmanager_donotpreservezoneinformation",
          "settingInstanceTemplateReference": null,
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "value": "user_vendor_msft_policy_config_attachmentmanager_donotpreservezoneinformation_0",
            "children": []
          }
        }
      },
      {
        "id": "3",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "user_vendor_msft_policy_config_attachmentmanager_notifyantivirusprograms",
          "settingInstanceTemplateReference": null,
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "value": "user_vendor_msft_policy_config_attachmentmanager_notifyantivirusprograms_1",
            "children": []
          }
        }
      },
      {
        "id": "4",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "user_vendor_msft_policy_config_admx_sharing_noinplacesharing",
          "settingInstanceTemplateReference": null,
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "value": "user_vendor_msft_policy_config_admx_sharing_noinplacesharing_1",
            "children": []
          }
        }
      },
      {
        "id": "5",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
          "settingDefinitionId": "user_vendor_msft_policy_config_experience_allowspotlightcollection",
          "settingInstanceTemplateReference": null,
          "simpleSettingValue": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
            "settingValueTemplateReference": null,
            "value": 0
          }
        }
      },
      {
        "id": "6",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "user_vendor_msft_policy_config_applicationmanagement_msialwaysinstallwithelevatedprivileges",
          "settingInstanceTemplateReference": null,
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "value": "user_vendor_msft_policy_config_applicationmanagement_msialwaysinstallwithelevatedprivileges_0",
            "children": []
          }
        }
      }
    ]
  }