{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
    "createdDateTime": "2025-02-20T16:37:23.6735227Z",
    "creationSource": null,
    "description": "CIS Microsoft Intune for Windows 11 Benchmark v 3.0.1 policies for Intune\nCIS Level 1\nWindows Update For Business Policies",
    "lastModifiedDateTime": "2025-02-20T16:37:23.6735227Z",
    "name": "CIS Microsoft Intune for Windows 11 Benchmark v 3.0.1 - Windows Update For Business",
    "platforms": "windows10",
    "priorityMetaData": null,
    "roleScopeTagIds": [
      "0"
    ],
    "settingCount": 6,
    "technologies": "mdm",
    "id": "2148af82-0f18-4f44-8330-fafcb8f0f595",
    "templateReference": {
      "templateId": "",
      "templateFamily": "none",
      "templateDisplayName": null,
      "templateDisplayVersion": null
    },
    "settings": [
      {
        "id": "0",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_update_allowautoupdate",
          "settingInstanceTemplateReference": null,
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "value": "device_vendor_msft_policy_config_update_allowautoupdate_3",
            "children": []
          }
        }
      },
      {
        "id": "1",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_update_setdisablepauseuxaccess",
          "settingInstanceTemplateReference": null,
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "value": "device_vendor_msft_policy_config_update_setdisablepauseuxaccess_1",
            "children": []
          }
        }
      },
      {
        "id": "2",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_update_deferfeatureupdatesperiodindays",
          "settingInstanceTemplateReference": null,
          "simpleSettingValue": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
            "settingValueTemplateReference": null,
            "value": 180
          }
        }
      },
      {
        "id": "3",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_update_deferqualityupdatesperiodindays",
          "settingInstanceTemplateReference": null,
          "simpleSettingValue": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
            "settingValueTemplateReference": null,
            "value": 0
          }
        }
      },
      {
        "id": "4",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_update_managepreviewbuilds",
          "settingInstanceTemplateReference": null,
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "value": "device_vendor_msft_policy_config_update_managepreviewbuilds_0",
            "children": []
          }
        }
      },
      {
        "id": "5",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_update_scheduledinstallday",
          "settingInstanceTemplateReference": null,
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "value": "device_vendor_msft_policy_config_update_scheduledinstallday_0",
            "children": []
          }
        }
      }
    ]
  }