{
  "displayName": "Admins-AppProtection-MSAdminPortals-AnyPlatform-MFA-CA101",
  "state": "disabled",
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "all"
    ],
    "platforms": null,
    "locations": null,
    "times": null,
    "deviceStates": null,
    "devices": null,
    "clientApplications": null,
    "applications": {
      "includeApplications": [
        "MicrosoftAdminPortals"
      ],
      "excludeApplications": [],
      "includeUserActions": [],
      "includeAuthenticationContextClassReferences": [],
      "applicationFilter": null
    },
    "users": {
      "excludeUsers": [
      ],
      "includeGroups": [],
      "excludeGroups": [],
      "includeRoles": [
        "62e90394-69f5-4237-9190-012177145e10",
        "194ae4cb-b126-40b2-bd5b-6091b380977d",
        "f28a1f50-f6e7-4571-818b-6a12f2af6b6c",
        "29232cdf-9323-42fd-ade2-1d097af3e4de",
        "b1be1c3e-b65d-4f19-8427-f6fa0d97feb9",
        "729827e3-9c14-49f7-bb1b-9608f156bbb8",
        "b0f54661-2d74-4c50-afa3-1ec803f12efe",
        "fe930be7-5e62-47db-91af-98c3a49a38b1",
        "c4e39bd9-1100-46d3-8c65-fb160da0071f",
        "9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3",
        "158c047a-c907-4556-b7ef-446551a6b5f7",
        "966707d0-3269-4727-9be2-8c3a10f19b9d",
        "7be44c8a-adaf-4e2a-84d6-ab2649e08a13",
        "e8611ab8-c189-46e8-94e1-60213ab1f814",
        "17315797-102d-40b4-93e0-432062caca18",
        "ac434307-12b9-4fa1-a708-88bf58caabc1",
        "fdd7a751-b60b-444a-984c-02652fe8fa1c",
        "3a2c62db-5318-420d-8d74-23affee5d9d5",
        "d37c8bed-0711-4417-ba38-b4abe66ce4c2",
        "11451d60-acb2-45eb-a7d6-43d0f0125c13"
      ],
      "excludeRoles": [],
      "includeGuestsOrExternalUsers": null,
      "excludeGuestsOrExternalUsers": null
    }
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": [],
    "customAuthenticationFactors": [],
    "termsOfUse": [],
    "authenticationStrength": {
      "id": "00000000-0000-0000-0000-000000000002"
    }
  },
  "sessionControls": { 
    "ApplicationEnforcedRestrictions": {
        "IsEnabled": null
    },
    "CloudAppSecurity": { 
        "CloudAppSecurityType": null,
        "IsEnabled": null 
    },
    "PersistentBrowser": { 
        "IsEnabled": null,
        "Mode": null 
    },
    "SignInFrequency": { 
        "AuthenticationType": null,
        "FrequencyInterval": null,
        "IsEnabled": null,
        "Type": null,
        "Value": null
    }
  }  
}
