{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
    "createdDateTime": "2025-03-01T23:32:52.074189Z",
    "creationSource": null,
    "description": "",
    "lastModifiedDateTime": "2025-03-01T23:32:52.074189Z",
    "name": "asr",
    "platforms": "windows10",
    "priorityMetaData": null,
    "roleScopeTagIds": [
      "0"
    ],
    "settingCount": 2,
    "technologies": "mdm,microsoftSense",
    "id": "247ea24e-6279-422d-82a1-bcb8a2a79771",
    "templateReference": {
      "templateId": "e8c053d6-9f95-42b1-a7f1-ebfd71c67a4b_1",
      "templateFamily": "endpointSecurityAttackSurfaceReduction",
      "templateDisplayName": "Attack Surface Reduction Rules",
      "templateDisplayVersion": "Version 1"
    },
    "settings": [
      {
        "id": "0",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "19600663-e264-4c02-8f55-f2983216d6d7"
          },
          "groupSettingCollectionValue": [
            {
              "settingValueTemplateReference": null,
              "children": [
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutionofpotentiallyobfuscatedscripts",
                  "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "e416083e-05e3-4237-b8ec-a6ad49c4571e"
                  },
                  "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutionofpotentiallyobfuscatedscripts_block",
                    "settingValueTemplateReference": {
                      "settingValueTemplateId": "8b17ebce-496f-4b58-9d89-dd1c3861de39",
                      "useTemplateDefault": false
                    },
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockwin32apicallsfromofficemacros",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockwin32apicallsfromofficemacros_block",
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutablefilesrunningunlesstheymeetprevalenceagetrustedlistcriterion",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutablefilesrunningunlesstheymeetprevalenceagetrustedlistcriterion_block",
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockofficecommunicationappfromcreatingchildprocesses",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockofficecommunicationappfromcreatingchildprocesses_block",
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockallofficeapplicationsfromcreatingchildprocesses",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockallofficeapplicationsfromcreatingchildprocesses_block",
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockadobereaderfromcreatingchildprocesses",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockadobereaderfromcreatingchildprocesses_block",
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockcredentialstealingfromwindowslocalsecurityauthoritysubsystem",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockcredentialstealingfromwindowslocalsecurityauthoritysubsystem_block",
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockjavascriptorvbscriptfromlaunchingdownloadedexecutablecontent",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockjavascriptorvbscriptfromlaunchingdownloadedexecutablecontent_block",
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockwebshellcreationforservers",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockwebshellcreationforservers_block",
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockuntrustedunsignedprocessesthatrunfromusb",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockuntrustedunsignedprocessesthatrunfromusb_block",
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockpersistencethroughwmieventsubscription",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockpersistencethroughwmieventsubscription_block",
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockuseofcopiedorimpersonatedsystemtools",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockuseofcopiedorimpersonatedsystemtools_block",
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockabuseofexploitedvulnerablesigneddrivers",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockabuseofexploitedvulnerablesigneddrivers_block",
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockprocesscreationsfrompsexecandwmicommands",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockprocesscreationsfrompsexecandwmicommands_block",
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockofficeapplicationsfromcreatingexecutablecontent",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockofficeapplicationsfromcreatingexecutablecontent_block",
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockofficeapplicationsfrominjectingcodeintootherprocesses",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockofficeapplicationsfrominjectingcodeintootherprocesses_block",
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockrebootingmachineinsafemode",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockrebootingmachineinsafemode_block",
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_useadvancedprotectionagainstransomware",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_useadvancedprotectionagainstransomware_block",
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutablecontentfromemailclientandwebmail",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutablecontentfromemailclientandwebmail_block",
                    "children": []
                  }
                }
              ]
            }
          ]
        }
      },
      {
        "id": "1",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_enablecontrolledfolderaccess",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "78c83b32-56c0-445a-932a-872d69af6e49"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_enablecontrolledfolderaccess_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "e57db701-c3c6-4264-ab50-7896cb90dfd6",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      }
    ]
  }