{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
    "createdDateTime": "2025-03-01T23:11:13.2386102Z",
    "creationSource": null,
    "description": "Credential Guard and Windows Hello for Business Settings scoped for Devices",
    "lastModifiedDateTime": "2025-03-01T23:11:13.2386102Z",
    "name": "credential_guard-WHFB-Device",
    "platforms": "windows10",
    "priorityMetaData": null,
    "roleScopeTagIds": [
      "0"
    ],
    "settingCount": 3,
    "technologies": "mdm",
    "id": "fd158ae9-eb42-46f6-a15e-b2ea568b0d54",
    "templateReference": {
      "templateId": "fcef01f2-439d-4c3f-9184-823fd6e97646_1",
      "templateFamily": "endpointSecurityAccountProtection",
      "templateDisplayName": "Account Protection",
      "templateDisplayVersion": "Version 1"
    },
    "settings": [
      {
        "id": "0",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_deviceguard_lsacfgflags",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "66850271-9a32-4ec5-9dbd-1f57294c258f"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_deviceguard_lsacfgflags_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "ce65c01d-997c-48fb-89e4-b990ced6f5af",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "1",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_passportforwork_biometrics_facialfeaturesuseenhancedantispoofing",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "9a29ce6b-fae8-4785-bbfe-3311f14aa88f"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_passportforwork_biometrics_facialfeaturesuseenhancedantispoofing_true",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "93a7ef59-584d-4177-ac5a-2ca31d47e179",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "2",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
          "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "0ece2bdc-57c1-4be9-93e9-ac9c395a9c94"
          },
          "groupSettingCollectionValue": [
            {
              "settingValueTemplateReference": null,
              "children": [
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}_policies_enablepinrecovery",
                  "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "f7ac8ff7-1b26-469b-9872-00d68961fdc5"
                  },
                  "choiceSettingValue": {
                    "value": "device_vendor_msft_passportforwork_{tenantid}_policies_enablepinrecovery_true",
                    "settingValueTemplateReference": {
                      "settingValueTemplateId": "06ebb101-6342-4081-b208-87a13151afa5",
                      "useTemplateDefault": false
                    },
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_lowercaseletters",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_lowercaseletters_0",
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_minimumpinlength",
                  "settingInstanceTemplateReference": null,
                  "simpleSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                    "value": 6,
                    "settingValueTemplateReference": {
                      "settingValueTemplateId": "b2cec844-c747-466e-ae20-92969da2a10c",
                      "useTemplateDefault": false
                    }
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_specialcharacters",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_specialcharacters_0",
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_uppercaseletters",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_uppercaseletters_0",
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}_policies_requiresecuritydevice",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_passportforwork_{tenantid}_policies_requiresecuritydevice_true",
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}_policies_usecertificateforonpremauth",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_passportforwork_{tenantid}_policies_usecertificateforonpremauth_false",
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}_policies_usepassportforwork",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_passportforwork_{tenantid}_policies_usepassportforwork_true",
                    "children": []
                  }
                }
              ]
            }
          ]
        }
      }
    ]
  }