{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
    "createdDateTime": "2025-03-01T22:31:50.0072468Z",
    "creationSource": null,
    "description": "",
    "lastModifiedDateTime": "2025-03-01T22:31:50.0072468Z",
    "name": "Defender_Security_Experience",
    "platforms": "windows10",
    "priorityMetaData": null,
    "roleScopeTagIds": [
      "0"
    ],
    "settingCount": 3,
    "technologies": "mdm,microsoftSense",
    "id": "0ae1ce5b-d864-4b8d-9b40-8898366ecd89",
    "templateReference": {
      "templateId": "d948ff9b-99cb-4ee0-8012-1fbc09685377_1",
      "templateFamily": "endpointSecurityAntivirus",
      "templateDisplayName": "Windows Security Experience",
      "templateDisplayVersion": "Version 1"
    },
    "settings": [
      {
        "id": "0",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "vendor_msft_defender_configuration_tamperprotection_options",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "5655cab2-7e6b-4c49-9ce2-3865da05f7e6"
          },
          "choiceSettingValue": {
            "value": "vendor_msft_defender_configuration_tamperprotection_options_0",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "fc365da9-2c1b-4f79-aa4b-dedca69e728f",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "1",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_enablecustomizedtoasts",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "bcf504b2-0285-4ec5-8d3c-cf135d98d925"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_enablecustomizedtoasts_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "e0ce0a98-40e4-47ac-82e2-9de0616c6760",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "2",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_enableinappcustomization",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "71b7efe5-c134-40d4-9d88-463592e367a7"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_enableinappcustomization_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "0a59e152-c250-43a6-88bb-72b6a48f48dd",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      }
    ]
  }