{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
    "createdDateTime": "2025-03-01T22:29:16.4970916Z",
    "creationSource": null,
    "description": "Defender AntiVirus",
    "lastModifiedDateTime": "2025-03-01T22:29:16.4970916Z",
    "name": "Defender_AntiVirus",
    "platforms": "windows10",
    "priorityMetaData": null,
    "roleScopeTagIds": [
      "0"
    ],
    "settingCount": 36,
    "technologies": "mdm,microsoftSense",
    "id": "0d8b6528-3d5c-4df0-8409-266a760d6b4b",
    "templateReference": {
      "templateId": "804339ad-1553-4478-a742-138fb5807418_1",
      "templateFamily": "endpointSecurityAntivirus",
      "templateDisplayName": "Microsoft Defender Antivirus",
      "templateDisplayVersion": "Version 1"
    },
    "settings": [
      {
        "id": "0",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowarchivescanning",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "7c5c9cde-f74d-4d11-904f-de4c27f72d89"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_allowarchivescanning_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "9ead75d4-6f30-4bc5-8cc5-ab0f999d79f0",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "1",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowbehaviormonitoring",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "8eef615a-1aa0-46f4-a25a-12cbe65de5ab"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_allowbehaviormonitoring_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "905921da-95e2-4a10-9e30-fe5540002ce1",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "2",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowcloudprotection",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "7da139f1-9b7e-407d-853a-c2e5037cdc70"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_allowcloudprotection_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "16fe8afd-67be-4c50-8619-d535451a500c",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "3",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowemailscanning",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "b0d9ee81-de6a-4750-86d7-9397961c9852"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_allowemailscanning_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "fdf107fd-e13b-4507-9d8f-db4d93476af9",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "4",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowfullscanonmappednetworkdrives",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "dac47505-f072-48d6-9f23-8d93262d58ed"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_allowfullscanonmappednetworkdrives_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "3e920b10-3773-4ac5-957e-e5573aec6d04",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "5",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "fb36e70b-5bc9-488a-a949-8ea3ac1634d5"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "366c5727-629b-4a81-b50b-52f90282fa2c",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "6",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowintrusionpreventionsystem",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "d47f06e2-5378-43f2-adbc-e924538f1512"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_allowintrusionpreventionsystem_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "03738a99-7065-44cb-ba1e-93530ed906a7",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "7",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowioavprotection",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "fa06231d-aed4-4601-b631-3a37e85b62a0"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_allowioavprotection_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "df4e6cbd-f7ff-41c8-88cd-fa25264a237e",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "8",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowrealtimemonitoring",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "f0790e28-9231-4d37-8f44-84bb47ca1b3e"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_allowrealtimemonitoring_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "0492c452-1069-4b91-9363-93b8e006ab12",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "9",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowscanningnetworkfiles",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "f8f28442-0a6b-4b52-b42c-d31d9687c1cf"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_allowscanningnetworkfiles_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "7b8c858c-a17d-4623-9e20-f34b851670ce",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "10",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowscriptscanning",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "000cf176-949c-4c08-a5d4-90ed43718db7"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_allowscriptscanning_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "ab9e4320-c953-4067-ac9a-be2becd06b4a",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "11",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowuseruiaccess",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "0170a900-b0bc-4ccc-b7ce-dda9be49189b"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_allowuseruiaccess_0",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "4b6c9739-4449-4006-8e5f-3049136470ea",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "12",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_avgcpuloadfactor",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "816cc03e-8f96-4cba-b14f-2658d031a79a"
          },
          "simpleSettingValue": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
            "value": 30,
            "settingValueTemplateReference": {
              "settingValueTemplateId": "37195fb1-3743-4c8e-a0ce-b6fae6fa3acd",
              "useTemplateDefault": false
            }
          }
        }
      },
      {
        "id": "13",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_checkforsignaturesbeforerunningscan",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "4fea56e3-7bb6-4ad3-88c6-e364dd2f97b9"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_checkforsignaturesbeforerunningscan_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "010779d1-edd4-441d-8034-89ad57a863fe",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "14",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_cloudextendedtimeout",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "f61c2788-14e4-4e80-a5a7-bf2ff5052f63"
          },
          "simpleSettingValue": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
            "value": 50,
            "settingValueTemplateReference": {
              "settingValueTemplateId": "608f1561-b603-46bd-bf5f-0b9872002f75",
              "useTemplateDefault": false
            }
          }
        }
      },
      {
        "id": "15",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_puaprotection",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "c0135c2a-f802-44f4-9b71-b0b976411b8c"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_puaprotection_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "2d790211-18cb-4e32-b8cc-97407e2c0b45",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "16",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_realtimescandirection",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "f5ff00a4-e5c7-44cf-a650-9c7619ff1561"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_realtimescandirection_0",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "6b4e3497-cfbb-4761-a152-de935bbf3f07",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "17",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_scanparameter",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "27ca2652-46f3-4cc7-83f2-bf85ff722d84"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_scanparameter_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "70c8f42e-ee6a-4ef1-a070-cb0e9d472581",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "18",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_schedulescanday",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "087d3362-7e78-4983-96bc-1f4ea183f0e4"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_schedulescanday_0",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "7f4d9dda-6d48-4353-90ca-9fa7164c7215",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "19",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_schedulequickscantime",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "784a4af1-33fa-45f2-b945-138b7ff3bcb6"
          },
          "simpleSettingValue": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
            "value": 720,
            "settingValueTemplateReference": {
              "settingValueTemplateId": "5d5c55c8-1a4e-4272-830d-8dc64cd3ac03",
              "useTemplateDefault": false
            }
          }
        }
      },
      {
        "id": "20",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_disablecatchupfullscan",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "f881b08c-f047-40d2-b7d9-3dde7ce9ef64"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_disablecatchupfullscan_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "1b26092f-48c4-447b-99d4-e9c501542f1c",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "21",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_disablecatchupquickscan",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "dabf6781-9d5d-42da-822a-d4327aa2bdd1"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_disablecatchupquickscan_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "d263ced7-0d23-4095-9326-99c8b3f5d35b",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "22",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_enablenetworkprotection",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "f53ab20e-8af6-48f5-9fa1-46863e1e517e"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_enablenetworkprotection_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "ee58fb51-9ae5-408b-9406-b92b643f388a",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "23",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_signatureupdateinterval",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "89879f27-6b7d-44d4-a08e-0a0de3e9663d"
          },
          "simpleSettingValue": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
            "value": 3,
            "settingValueTemplateReference": {
              "settingValueTemplateId": "0af6bbed-a74a-4d08-8587-b16b10b774cb",
              "useTemplateDefault": false
            }
          }
        }
      },
      {
        "id": "24",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_submitsamplesconsent",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "bc47ce7d-a251-4cae-a8a2-6e8384904ab7"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_submitsamplesconsent_3",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "826ed4b6-e04f-4975-9d23-6f0904b0d87e",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "25",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_defender_configuration_disablelocaladminmerge",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "5f9a9c65-dea7-4987-a5f5-b28cfd9762ba"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_defender_configuration_disablelocaladminmerge_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "3a9774b2-3143-47eb-bbca-d73c0ace2b7e",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "26",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowonaccessprotection",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "afbc322b-083c-4281-8242-ebbb91398b41"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_allowonaccessprotection_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "ed077fee-9803-44f3-b045-aab34d8e6d52",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "27",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "f6394bc5-6486-4728-b510-555f5c161f2b"
          },
          "groupSettingCollectionValue": [
            {
              "settingValueTemplateReference": null,
              "children": [
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_highseveritythreats",
                  "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "f55b8c9c-d831-460e-a041-e47e29f2aa17"
                  },
                  "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_highseveritythreats_block",
                    "settingValueTemplateReference": {
                      "settingValueTemplateId": "764256b4-e4d7-46d9-bbc8-003bf23591a1",
                      "useTemplateDefault": false
                    },
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_severethreats",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_severethreats_block",
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_lowseveritythreats",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_lowseveritythreats_block",
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_moderateseveritythreats",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_moderateseveritythreats_block",
                    "children": []
                  }
                }
              ]
            }
          ]
        }
      },
      {
        "id": "28",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_defender_configuration_allownetworkprotectiondownlevel",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "d7342aaf-833d-4afc-92d6-e9621256a3cc"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_defender_configuration_allownetworkprotectiondownlevel_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "248fdbe0-e0c9-4b47-bce1-95c8058736fb",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "29",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_defender_configuration_allowdatagramprocessingonwinserver",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "69fa7ce4-6cd8-4699-aff7-024a889c25ce"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_defender_configuration_allowdatagramprocessingonwinserver_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "0333679d-3b8a-4b51-9f8e-bba39b263712",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "30",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_defender_configuration_disablednsovertcpparsing",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "522811d2-c99e-4e6d-9cf5-36779498aec6"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_defender_configuration_disablednsovertcpparsing_0",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "19e3f074-15d5-43ec-8718-2e09aee0a972",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "31",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_defender_configuration_disablehttpparsing",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "662abd23-4077-4b4b-a305-7f104ef28beb"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_defender_configuration_disablehttpparsing_0",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "d4a20dd5-8cc2-4b7e-ac84-6f76fde3cfc9",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "32",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_defender_configuration_disablesshparsing",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "f092fb32-a546-4111-a4d0-cd9f57787fd7"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_defender_configuration_disablesshparsing_0",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "514d2640-09d4-428e-835d-dd1d63fba8fb",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "33",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_defender_configuration_disabletlsparsing",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "b806c934-b19f-40b5-8d87-36117976c161"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_defender_configuration_disabletlsparsing_0",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "a4872f4f-6588-4110-a250-635b2267a5ad",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "34",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_defender_configuration_enablednssinkhole",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "c2d4039a-b57e-41df-9e2a-23ace9b51972"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_defender_configuration_enablednssinkhole_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "0110668a-f308-411b-9b82-6567f6bbbd9c",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "35",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_defender_configuration_meteredconnectionupdates",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "7e3aaffb-309f-46de-8cd7-25c1a3b19e5b"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_defender_configuration_meteredconnectionupdates_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "20cf972c-be3f-4bc1-93d3-781829d55233",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      }
    ]
  }