{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
    "createdDateTime": "2025-03-01T23:25:54.7853392Z",
    "creationSource": null,
    "description": "",
    "lastModifiedDateTime": "2025-03-01T23:25:54.7853392Z",
    "name": "device_control",
    "platforms": "windows10",
    "priorityMetaData": null,
    "roleScopeTagIds": [
      "0"
    ],
    "settingCount": 20,
    "technologies": "mdm,microsoftSense",
    "id": "9a35dfc6-1629-436f-b544-863a04b6c5b4",
    "templateReference": {
      "templateId": "0f2034c6-3cd6-4ee1-bd37-f3c0693e9548_1",
      "templateFamily": "endpointSecurityAttackSurfaceReduction",
      "templateDisplayName": "Device Control",
      "templateDisplayVersion": "Version 1"
    },
    "settings": [
      {
        "id": "0",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_bluetooth_allowadvertising",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "d6ead715-5428-4f4d-8319-cdc36859a9a6"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_bluetooth_allowadvertising_0",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "157fc668-25ea-4d32-aa04-283a756dcc6a",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "1",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_bluetooth_allowdiscoverablemode",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "edf51c88-6f17-48f6-ac78-4fdeb8a10b80"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_bluetooth_allowdiscoverablemode_0",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "ca751fac-3053-4dfe-aa76-7f550138a2de",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "2",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_bluetooth_allowpromptedproximalconnections",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "f1015b71-30b9-4933-a4bf-0ff6068a6d55"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_bluetooth_allowpromptedproximalconnections_0",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "a6867af2-5a01-4e8f-806a-35c590993db8",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "3",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_bluetooth_allowprepairing",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "9e08feef-b150-4c91-85da-2e3437aa66b0"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_bluetooth_allowprepairing_0",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "4c6ec0ed-54ce-4355-be10-1f6969109613",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "4",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_system_allowstoragecard",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "09592b67-f7d2-4fce-b411-3ab6c959edf2"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_system_allowstoragecard_0",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "1127482d-530b-425c-ac62-9d23299dcd2b",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "5",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_allowusbconnection",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "bc92aa99-0993-4c65-a005-d5e5e6701486"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_connectivity_allowusbconnection_0",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "0859f615-a7f0-4043-b559-2ec927748de2",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "6",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_allowbluetooth",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "5c10bf3f-d815-4f68-b9d2-1c71ea111793"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_connectivity_allowbluetooth_0",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "22424b5e-5950-4b05-982d-fb7359ac759c",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "7",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_storage_removablediskdenywriteaccess",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "c6cf4c83-3a28-4744-be79-3c2317df35fc"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_storage_removablediskdenywriteaccess_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "c123806c-8430-421b-ba5c-b92b9e396276",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "8",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_dmaguard_deviceenumerationpolicy",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "60e06b54-bea1-40f1-b2e1-b4c8bdfa4bd6"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_dmaguard_deviceenumerationpolicy_0",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "531c5701-6ba0-442a-8a3d-326282e96b82",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "9",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_dataprotection_allowdirectmemoryaccess",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "6368f074-9ebb-4492-8de6-9a360cd7cc5b"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_dataprotection_allowdirectmemoryaccess_0",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "65507cf9-eb47-4250-bc4d-3203a1652078",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "10",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_admx_removablestorage_wpddevices_denyread_access_2",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "8d409410-4bb9-4d3a-b828-8b556e8a25a3"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_admx_removablestorage_wpddevices_denyread_access_2_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "aebbf913-0f0d-43cb-87b3-bc6630630929",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "11",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "user_vendor_msft_policy_config_admx_removablestorage_wpddevices_denyread_access_1",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "6bd30ddd-3539-42d7-b40b-abf1283e2a2e"
          },
          "choiceSettingValue": {
            "value": "user_vendor_msft_policy_config_admx_removablestorage_wpddevices_denyread_access_1_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "cf103324-ba05-4978-8f72-afa18e118ce3",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "12",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_admx_removablestorage_wpddevices_denywrite_access_2",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "9fe38872-0f2b-4742-8ef5-9fad6ac63c33"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_admx_removablestorage_wpddevices_denywrite_access_2_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "44168606-c3ca-4dfe-ad48-319df17d23b1",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "13",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "user_vendor_msft_policy_config_admx_removablestorage_wpddevices_denywrite_access_1",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "b423e7b8-9910-4114-82ca-f600356a3e46"
          },
          "choiceSettingValue": {
            "value": "user_vendor_msft_policy_config_admx_removablestorage_wpddevices_denywrite_access_1_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "fe53f705-8bba-4c62-8fd6-b019091c9168",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "14",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_admx_deviceinstallation_deviceinstall_removable_deny",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "e3eb4037-0645-4f39-8c25-50e075b79065"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_admx_deviceinstallation_deviceinstall_removable_deny_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "ab0819f8-8e92-4e14-9f76-b7585045b578",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "15",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofdevicesnotdescribedbyotherpolicysettings",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "a85927b5-9669-4cfe-82b1-81bdc4d37466"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofdevicesnotdescribedbyotherpolicysettings_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "dd178fa3-0238-40c3-93af-d6e13ad9cac3",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "16",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_deviceinstallation_enableinstallationpolicylayering",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "aa31f13a-b613-4776-a27b-f1e278bfb65a"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_deviceinstallation_enableinstallationpolicylayering_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "e9bca933-0294-43f4-a4c6-d3a253fd2393",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "17",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_defender_configuration_devicecontrolenabled",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "358ec504-d488-46b9-bbb0-f020763d468a"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_defender_configuration_devicecontrolenabled_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "05bcff50-f939-49fa-9671-f77f51fe0fe6",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "18",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "3e830855-161b-495d-833c-a28f004ce677"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "9ffa57a4-f4c7-4832-8f72-03c86489149f",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      },
      {
        "id": "19",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_defender_configuration_defaultenforcement",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "37ce17c1-c509-4e46-a5cf-013b8c9605dc"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_defender_configuration_defaultenforcement_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "f3c4636e-5c45-4eab-975c-5674971fc392",
              "useTemplateDefault": false
            },
            "children": []
          }
        }
      }
    ]
  }