{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2023-01-31T09:53:01.6693357Z","creationSource":null,"description":"","lastModifiedDateTime":"2023-04-21T20:40:42.448574Z","name":"Exploit_Protection","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":2,"technologies":"mdm","id":"f310f353-a6f4-4c34-8cd4-64ebd9c3fc18","templateReference":{"templateId":"d02f2162-fcac-48db-9b7b-b0a3f160d2c2_1","templateFamily":"endpointSecurityAttackSurfaceReduction","templateDisplayName":"Exploit Protection","templateDisplayVersion":"Version 1"},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_exploitguard_exploitprotectionsettings","settingInstanceTemplateReference":{"settingInstanceTemplateId":"75323898-c56b-46ed-96eb-5b757cd67add"},"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationStringSettingValue","value":"<?xml version=\"1.0\" encoding=\"UTF-8\"?>\r\n<MitigationPolicy>\r\n  <AppConfig Executable=\"clview.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"cnfnot32.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"excel.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"excelcnv.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"ExtExport.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"graph.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"groove.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"ie4uinit.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"ieinstal.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"ielowutil.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"ieUnatt.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"iexplore.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"lync.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"msaccess.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"mscorsvw.exe\">\r\n    <ExtensionPoints DisableExtensionPoints=\"true\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"msfeedssync.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"mshta.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"msoadfsb.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"msoasb.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"msohtmed.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"msosrec.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"msoxmled.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"mspub.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"msqry32.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"MsSense.exe\">\r\n    <ExtensionPoints DisableExtensionPoints=\"true\" />\r\n    <ImageLoad PreferSystem32=\"true\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"ngen.exe\">\r\n    <ExtensionPoints DisableExtensionPoints=\"true\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"ngentask.exe\">\r\n    <ExtensionPoints DisableExtensionPoints=\"true\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"onenote.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"onenotem.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"orgchart.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"outlook.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"powerpnt.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"PresentationHost.exe\">\r\n    <DEP Enable=\"true\" EmulateAtlThunks=\"false\" />\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" BottomUp=\"true\" HighEntropy=\"true\" />\r\n    <SEHOP Enable=\"true\" TelemetryOnly=\"false\" />\r\n    <Heap TerminateOnError=\"true\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"PrintDialog.exe\">\r\n    <ExtensionPoints DisableExtensionPoints=\"true\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"runtimebroker.exe\">\r\n    <ExtensionPoints DisableExtensionPoints=\"true\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"scanost.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"scanpst.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"sdxhelper.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"selfcert.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"setlang.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"SystemSettings.exe\">\r\n    <ExtensionPoints DisableExtensionPoints=\"true\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"winword.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n  <AppConfig Executable=\"wordconv.exe\">\r\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" />\r\n  </AppConfig>\r\n</MitigationPolicy>","settingValueTemplateReference":{"settingValueTemplateId":"b8ee6c7a-cfee-4055-9a89-225ff35e2eb4","useTemplateDefault":false}}}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_windowsdefendersecuritycenter_disallowexploitprotectionoverride","settingInstanceTemplateReference":{"settingInstanceTemplateId":"e4be83c7-691b-488d-b068-2d82a1cced8e"},"choiceSettingValue":{"value":"device_vendor_msft_policy_config_windowsdefendersecuritycenter_disallowexploitprotectionoverride_1","settingValueTemplateReference":{"settingValueTemplateId":"ddd5a881-2956-4a44-a95b-8e4a69c70170","useTemplateDefault":false},"children":[]}}}]}