{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-03-01T23:36:29.9138553Z","creationSource":null,"description":"","lastModifiedDateTime":"2025-03-01T23:36:29.9138553Z","name":"x_app-browser_isolation","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":2,"technologies":"mdm","id":"f22bcc10-477f-4aa3-b03e-6b7763f0a59e","templateReference":{"templateId":"9f667e40-8f3c-4f88-80d8-457f16906315_1","templateFamily":"endpointSecurityAttackSurfaceReduction","templateDisplayName":"App and Browser Isolation","templateDisplayVersion":"Version 1"},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_windowsdefenderapplicationguard_settings_allowwindowsdefenderapplicationguard","settingInstanceTemplateReference":{"settingInstanceTemplateId":"1f2529c7-4b06-4ae6-bebc-210f7135676f"},"choiceSettingValue":{"value":"device_vendor_msft_windowsdefenderapplicationguard_settings_allowwindowsdefenderapplicationguard_3","settingValueTemplateReference":{"settingValueTemplateId":"4bacad31-1b46-4313-b4f7-5a1df8336d34","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_windowsdefenderapplicationguard_installwindowsdefenderapplicationguard","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_windowsdefenderapplicationguard_installwindowsdefenderapplicationguard_install","settingValueTemplateReference":{"settingValueTemplateId":"4bacad31-1b46-4313-b4f7-5a1df8336d34","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_windowsdefenderapplicationguard_settings_allowcameramicrophoneredirection","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_windowsdefenderapplicationguard_settings_allowcameramicrophoneredirection_1","settingValueTemplateReference":{"settingValueTemplateId":"4bacad31-1b46-4313-b4f7-5a1df8336d34","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_windowsdefenderapplicationguard_settings_allowpersistence","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_windowsdefenderapplicationguard_settings_allowpersistence_1","settingValueTemplateReference":{"settingValueTemplateId":"4bacad31-1b46-4313-b4f7-5a1df8336d34","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_windowsdefenderapplicationguard_settings_savefilestohost","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_windowsdefenderapplicationguard_settings_savefilestohost_1","settingValueTemplateReference":{"settingValueTemplateId":"4bacad31-1b46-4313-b4f7-5a1df8336d34","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_windowsdefenderapplicationguard_settings_allowvirtualgpu","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_windowsdefenderapplicationguard_settings_allowvirtualgpu_1","settingValueTemplateReference":{"settingValueTemplateId":"4bacad31-1b46-4313-b4f7-5a1df8336d34","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_windowsdefenderapplicationguard_settings_clipboardsettings","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_windowsdefenderapplicationguard_settings_clipboardsettings_3","settingValueTemplateReference":{"settingValueTemplateId":"4bacad31-1b46-4313-b4f7-5a1df8336d34","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_windowsdefenderapplicationguard_settings_clipboardfiletype","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_windowsdefenderapplicationguard_settings_clipboardfiletype_3","settingValueTemplateReference":{"settingValueTemplateId":"4bacad31-1b46-4313-b4f7-5a1df8336d34","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionInstance","settingDefinitionId":"device_vendor_msft_windowsdefenderapplicationguard_settings_printingsettings","settingInstanceTemplateReference":null,"choiceSettingCollectionValue":[{"settingValueTemplateReference":null,"value":"device_vendor_msft_windowsdefenderapplicationguard_settings_printingsettings_8","children":[]},{"settingValueTemplateReference":null,"value":"device_vendor_msft_windowsdefenderapplicationguard_settings_printingsettings_2","children":[]}]}]}}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_windowsdefenderapplicationguard_audit_auditapplicationguard","settingInstanceTemplateReference":{"settingInstanceTemplateId":"1afb3b79-f47e-49bb-b054-34aa47c92075"},"choiceSettingValue":{"value":"device_vendor_msft_windowsdefenderapplicationguard_audit_auditapplicationguard_1","settingValueTemplateReference":{"settingValueTemplateId":"9942e985-b6a4-4e1b-89e7-36757a66ba70","useTemplateDefault":false},"children":[]}}}]}