{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-03-01T22:44:36.6207107Z","creationSource":null,"description":"","lastModifiedDateTime":"2025-03-01T22:44:36.6207107Z","name":"x_BitLocker_encrytion","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":13,"technologies":"mdm","id":"cb01461e-1e5b-4ae3-970f-24305590bb8f","templateReference":{"templateId":"46ddfc50-d10f-4867-b852-9434254b3bff_1","templateFamily":"endpointSecurityDiskEncryption","templateDisplayName":"BitLocker","templateDisplayVersion":"Version 1"},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_requiredeviceencryption","settingInstanceTemplateReference":{"settingInstanceTemplateId":"20ec1f6e-0d7a-4b6f-9a4f-9ed33e69ce51"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_requiredeviceencryption_1","settingValueTemplateReference":{"settingValueTemplateId":"86da5fa5-67cf-48d1-8215-8787a9900ae6","useTemplateDefault":false},"children":[]}}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_allowwarningforotherdiskencryption","settingInstanceTemplateReference":{"settingInstanceTemplateId":"e40531ee-2225-406b-b07b-1c17186c088c"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_allowwarningforotherdiskencryption_1","settingValueTemplateReference":{"settingValueTemplateId":"7d348597-0f2a-43db-9fad-8b55c4f89bfe","useTemplateDefault":false},"children":[]}}},{"id":"2","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_configurerecoverypasswordrotation","settingInstanceTemplateReference":{"settingInstanceTemplateId":"48c938a7-afa0-40ef-914f-40b5da5735b4"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_configurerecoverypasswordrotation_2","settingValueTemplateReference":{"settingValueTemplateId":"48278072-3b30-48e9-b654-ad683fdb9aae","useTemplateDefault":false},"children":[]}}},{"id":"3","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_encryptionmethodbydrivetype","settingInstanceTemplateReference":{"settingInstanceTemplateId":"d1625438-8db8-424f-b605-cf001b7a2f97"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1","settingValueTemplateReference":{"settingValueTemplateId":"7cd99564-6bd0-42c8-be6a-5d92c6c1faaf","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name_4","settingValueTemplateReference":{"settingValueTemplateId":"7cd99564-6bd0-42c8-be6a-5d92c6c1faaf","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name_7","settingValueTemplateReference":{"settingValueTemplateId":"7cd99564-6bd0-42c8-be6a-5d92c6c1faaf","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name_7","settingValueTemplateReference":{"settingValueTemplateId":"7cd99564-6bd0-42c8-be6a-5d92c6c1faaf","useTemplateDefault":false},"children":[]}}]}}},{"id":"4","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesencryptiontype","settingInstanceTemplateReference":{"settingInstanceTemplateId":"d3e31794-1ce6-4572-ab0c-0c0f9200a509"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesencryptiontype_1","settingValueTemplateReference":{"settingValueTemplateId":"54f346c7-008f-421c-bcb5-40f822bb97fe","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name_2","settingValueTemplateReference":{"settingValueTemplateId":"54f346c7-008f-421c-bcb5-40f822bb97fe","useTemplateDefault":false},"children":[]}}]}}},{"id":"5","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication","settingInstanceTemplateReference":{"settingInstanceTemplateId":"a5673a18-196d-49a0-a460-a8f35b807b45"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_1","settingValueTemplateReference":{"settingValueTemplateId":"f742e25d-2f09-41f7-9556-6af75960f42b","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmstartupkeyusagedropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmstartupkeyusagedropdown_name_2","settingValueTemplateReference":{"settingValueTemplateId":"f742e25d-2f09-41f7-9556-6af75960f42b","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurepinusagedropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurepinusagedropdown_name_2","settingValueTemplateReference":{"settingValueTemplateId":"f742e25d-2f09-41f7-9556-6af75960f42b","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmpinkeyusagedropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmpinkeyusagedropdown_name_2","settingValueTemplateReference":{"settingValueTemplateId":"f742e25d-2f09-41f7-9556-6af75960f42b","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurenontpmstartupkeyusage_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurenontpmstartupkeyusage_name_0","settingValueTemplateReference":{"settingValueTemplateId":"f742e25d-2f09-41f7-9556-6af75960f42b","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmusagedropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmusagedropdown_name_1","settingValueTemplateReference":{"settingValueTemplateId":"f742e25d-2f09-41f7-9556-6af75960f42b","useTemplateDefault":false},"children":[]}}]}}},{"id":"6","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesenhancedpin","settingInstanceTemplateReference":{"settingInstanceTemplateId":"1eb5feff-b03f-44ab-a5ce-198de8e4741e"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesenhancedpin_1","settingValueTemplateReference":{"settingValueTemplateId":"9e261c1d-9eb0-4edb-a9cf-d86390683954","useTemplateDefault":false},"children":[]}}},{"id":"7","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesminimumpinlength","settingInstanceTemplateReference":{"settingInstanceTemplateId":"0b4775b0-8f27-4d40-b68d-b4e521d91230"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesminimumpinlength_1","settingValueTemplateReference":{"settingValueTemplateId":"041be1b9-62b2-478b-bb0c-fc3f712aa750","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesminimumpinlength_minpinlength","settingInstanceTemplateReference":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue","value":8,"settingValueTemplateReference":{"settingValueTemplateId":"041be1b9-62b2-478b-bb0c-fc3f712aa750","useTemplateDefault":false}}}]}}},{"id":"8","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesdisallowstandarduserscanchangepin","settingInstanceTemplateReference":{"settingInstanceTemplateId":"ff95fd7f-52a0-4030-8452-6143352ab487"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesdisallowstandarduserscanchangepin_1","settingValueTemplateReference":{"settingValueTemplateId":"3b874ce3-3254-4db9-ab65-1b591f543ed3","useTemplateDefault":false},"children":[]}}},{"id":"9","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesenableprebootinputprotectorsonslates","settingInstanceTemplateReference":{"settingInstanceTemplateId":"f85aa8db-2f1b-4568-a13d-388a504ee610"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesenableprebootinputprotectorsonslates_1","settingValueTemplateReference":{"settingValueTemplateId":"1f53e191-0268-4d02-92df-c9b55a0d066a","useTemplateDefault":false},"children":[]}}},{"id":"10","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions","settingInstanceTemplateReference":{"settingInstanceTemplateId":"5a350519-4bc6-4443-9c4b-6859a054ff83"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1","settingValueTemplateReference":{"settingValueTemplateId":"2a756c45-f135-442f-9c01-829a9c9b5407","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name_1","settingValueTemplateReference":{"settingValueTemplateId":"2a756c45-f135-442f-9c01-829a9c9b5407","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name_1","settingValueTemplateReference":{"settingValueTemplateId":"2a756c45-f135-442f-9c01-829a9c9b5407","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name_1","settingValueTemplateReference":{"settingValueTemplateId":"2a756c45-f135-442f-9c01-829a9c9b5407","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name_1","settingValueTemplateReference":{"settingValueTemplateId":"2a756c45-f135-442f-9c01-829a9c9b5407","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name_1","settingValueTemplateReference":{"settingValueTemplateId":"2a756c45-f135-442f-9c01-829a9c9b5407","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name_1","settingValueTemplateReference":{"settingValueTemplateId":"2a756c45-f135-442f-9c01-829a9c9b5407","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name_1","settingValueTemplateReference":{"settingValueTemplateId":"2a756c45-f135-442f-9c01-829a9c9b5407","useTemplateDefault":false},"children":[]}}]}}},{"id":"11","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_fixeddrivesencryptiontype","settingInstanceTemplateReference":{"settingInstanceTemplateId":"85a47676-5027-4b14-9f99-e4625728244a"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_fixeddrivesencryptiontype_1","settingValueTemplateReference":{"settingValueTemplateId":"bdc82022-1c59-49a3-ac69-50e329650297","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_fixeddrivesencryptiontype_fdvencryptiontypedropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_fixeddrivesencryptiontype_fdvencryptiontypedropdown_name_2","settingValueTemplateReference":{"settingValueTemplateId":"bdc82022-1c59-49a3-ac69-50e329650297","useTemplateDefault":false},"children":[]}}]}}},{"id":"12","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions","settingInstanceTemplateReference":{"settingInstanceTemplateId":"ad21af4f-e42f-4870-85d8-1949e9adfad7"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1","settingValueTemplateReference":{"settingValueTemplateId":"2159ffae-55e2-406b-98b4-2ecdd9452c68","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackupdropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackupdropdown_name_1","settingValueTemplateReference":{"settingValueTemplateId":"2159ffae-55e2-406b-98b4-2ecdd9452c68","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackup_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackup_name_1","settingValueTemplateReference":{"settingValueTemplateId":"2159ffae-55e2-406b-98b4-2ecdd9452c68","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvhiderecoverypage_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvhiderecoverypage_name_1","settingValueTemplateReference":{"settingValueTemplateId":"2159ffae-55e2-406b-98b4-2ecdd9452c68","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrequireactivedirectorybackup_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrequireactivedirectorybackup_name_1","settingValueTemplateReference":{"settingValueTemplateId":"2159ffae-55e2-406b-98b4-2ecdd9452c68","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvallowdra_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvallowdra_name_1","settingValueTemplateReference":{"settingValueTemplateId":"2159ffae-55e2-406b-98b4-2ecdd9452c68","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name_1","settingValueTemplateReference":{"settingValueTemplateId":"2159ffae-55e2-406b-98b4-2ecdd9452c68","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverykeyusagedropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverykeyusagedropdown_name_1","settingValueTemplateReference":{"settingValueTemplateId":"2159ffae-55e2-406b-98b4-2ecdd9452c68","useTemplateDefault":false},"children":[]}}]}}}]}