{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-03-01T23:03:11.1484819Z","creationSource":null,"description":"","lastModifiedDateTime":"2025-03-01T23:03:11.1484819Z","name":"x_Defender_Firewall","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":6,"technologies":"mdm,microsoftSense","id":"18e9a75d-5291-405a-b144-569a5a3de12f","templateReference":{"templateId":"6078910e-d808-4a9f-a51d-1b8a7bacb7c0_1","templateFamily":"endpointSecurityFirewall","templateDisplayName":"Windows Firewall","templateDisplayVersion":"Version 1"},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall","settingInstanceTemplateReference":{"settingInstanceTemplateId":"7714c373-a19a-4b64-ba6d-2e9db04a7684"},"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true","settingValueTemplateReference":{"settingValueTemplateId":"120c5dbe-0c88-46f0-b897-2c996d3e5277","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_domainprofile_logmaxfilesize","settingInstanceTemplateReference":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue","value":16384,"settingValueTemplateReference":{"settingValueTemplateId":"120c5dbe-0c88-46f0-b897-2c996d3e5277","useTemplateDefault":false}}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_domainprofile_logfilepath","settingInstanceTemplateReference":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationStringSettingValue","value":"%SystemRoot%\\System32\\logfiles\\firewall\\domainfw.log","settingValueTemplateReference":{"settingValueTemplateId":"120c5dbe-0c88-46f0-b897-2c996d3e5277","useTemplateDefault":false}}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_domainprofile_allowlocalpolicymerge","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_domainprofile_allowlocalpolicymerge_false","settingValueTemplateReference":{"settingValueTemplateId":"120c5dbe-0c88-46f0-b897-2c996d3e5277","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_domainprofile_allowlocalipsecpolicymerge","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_domainprofile_allowlocalipsecpolicymerge_false","settingValueTemplateReference":{"settingValueTemplateId":"120c5dbe-0c88-46f0-b897-2c996d3e5277","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_domainprofile_authappsallowuserprefmerge","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_domainprofile_authappsallowuserprefmerge_false","settingValueTemplateReference":{"settingValueTemplateId":"120c5dbe-0c88-46f0-b897-2c996d3e5277","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_domainprofile_defaultinboundaction","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_domainprofile_defaultinboundaction_1","settingValueTemplateReference":{"settingValueTemplateId":"120c5dbe-0c88-46f0-b897-2c996d3e5277","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_domainprofile_defaultoutboundaction","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_domainprofile_defaultoutboundaction_0","settingValueTemplateReference":{"settingValueTemplateId":"120c5dbe-0c88-46f0-b897-2c996d3e5277","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmode","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmode_true","settingValueTemplateReference":{"settingValueTemplateId":"120c5dbe-0c88-46f0-b897-2c996d3e5277","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_domainprofile_disableinboundnotifications","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_domainprofile_disableinboundnotifications_true","settingValueTemplateReference":{"settingValueTemplateId":"120c5dbe-0c88-46f0-b897-2c996d3e5277","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmodeipsecsecuredpacketexemption","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmodeipsecsecuredpacketexemption_true","settingValueTemplateReference":{"settingValueTemplateId":"120c5dbe-0c88-46f0-b897-2c996d3e5277","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_domainprofile_disableunicastresponsestomulticastbroadcast","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_domainprofile_disableunicastresponsestomulticastbroadcast_true","settingValueTemplateReference":{"settingValueTemplateId":"120c5dbe-0c88-46f0-b897-2c996d3e5277","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_domainprofile_enablelogdroppedpackets","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_domainprofile_enablelogdroppedpackets_true","settingValueTemplateReference":{"settingValueTemplateId":"120c5dbe-0c88-46f0-b897-2c996d3e5277","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_domainprofile_enablelogignoredrules","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_domainprofile_enablelogignoredrules_true","settingValueTemplateReference":{"settingValueTemplateId":"120c5dbe-0c88-46f0-b897-2c996d3e5277","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_domainprofile_enablelogsuccessconnections","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_domainprofile_enablelogsuccessconnections_true","settingValueTemplateReference":{"settingValueTemplateId":"120c5dbe-0c88-46f0-b897-2c996d3e5277","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_domainprofile_globalportsallowuserprefmerge","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_domainprofile_globalportsallowuserprefmerge_false","settingValueTemplateReference":{"settingValueTemplateId":"120c5dbe-0c88-46f0-b897-2c996d3e5277","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_domainprofile_shielded","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_domainprofile_shielded_false","settingValueTemplateReference":{"settingValueTemplateId":"120c5dbe-0c88-46f0-b897-2c996d3e5277","useTemplateDefault":false},"children":[]}}]}}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall","settingInstanceTemplateReference":{"settingInstanceTemplateId":"1c14f914-69bb-49f8-af5b-e29173a6ee95"},"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true","settingValueTemplateReference":{"settingValueTemplateId":"9d55dfae-d55f-4f2a-af03-9a9524f61e76","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_privateprofile_logfilepath","settingInstanceTemplateReference":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationStringSettingValue","value":"%SystemRoot%\\System32\\logfiles\\firewall\\privatefw.log","settingValueTemplateReference":{"settingValueTemplateId":"9d55dfae-d55f-4f2a-af03-9a9524f61e76","useTemplateDefault":false}}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_privateprofile_logmaxfilesize","settingInstanceTemplateReference":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue","value":16384,"settingValueTemplateReference":{"settingValueTemplateId":"9d55dfae-d55f-4f2a-af03-9a9524f61e76","useTemplateDefault":false}}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge_false","settingValueTemplateReference":{"settingValueTemplateId":"9d55dfae-d55f-4f2a-af03-9a9524f61e76","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge_false","settingValueTemplateReference":{"settingValueTemplateId":"9d55dfae-d55f-4f2a-af03-9a9524f61e76","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_privateprofile_authappsallowuserprefmerge","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_privateprofile_authappsallowuserprefmerge_false","settingValueTemplateReference":{"settingValueTemplateId":"9d55dfae-d55f-4f2a-af03-9a9524f61e76","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction_1","settingValueTemplateReference":{"settingValueTemplateId":"9d55dfae-d55f-4f2a-af03-9a9524f61e76","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_privateprofile_defaultoutboundaction","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_privateprofile_defaultoutboundaction_0","settingValueTemplateReference":{"settingValueTemplateId":"9d55dfae-d55f-4f2a-af03-9a9524f61e76","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_privateprofile_disableinboundnotifications","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_privateprofile_disableinboundnotifications_true","settingValueTemplateReference":{"settingValueTemplateId":"9d55dfae-d55f-4f2a-af03-9a9524f61e76","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode_true","settingValueTemplateReference":{"settingValueTemplateId":"9d55dfae-d55f-4f2a-af03-9a9524f61e76","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmodeipsecsecuredpacketexemption","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmodeipsecsecuredpacketexemption_true","settingValueTemplateReference":{"settingValueTemplateId":"9d55dfae-d55f-4f2a-af03-9a9524f61e76","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast_true","settingValueTemplateReference":{"settingValueTemplateId":"9d55dfae-d55f-4f2a-af03-9a9524f61e76","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_privateprofile_enablelogdroppedpackets","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_privateprofile_enablelogdroppedpackets_true","settingValueTemplateReference":{"settingValueTemplateId":"9d55dfae-d55f-4f2a-af03-9a9524f61e76","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_privateprofile_enablelogignoredrules","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_privateprofile_enablelogignoredrules_true","settingValueTemplateReference":{"settingValueTemplateId":"9d55dfae-d55f-4f2a-af03-9a9524f61e76","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_privateprofile_enablelogsuccessconnections","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_privateprofile_enablelogsuccessconnections_true","settingValueTemplateReference":{"settingValueTemplateId":"9d55dfae-d55f-4f2a-af03-9a9524f61e76","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_privateprofile_globalportsallowuserprefmerge","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_privateprofile_globalportsallowuserprefmerge_false","settingValueTemplateReference":{"settingValueTemplateId":"9d55dfae-d55f-4f2a-af03-9a9524f61e76","useTemplateDefault":false},"children":[]}}]}}},{"id":"2","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall","settingInstanceTemplateReference":{"settingInstanceTemplateId":"e2714734-708e-4286-8ae9-d56821e306a3"},"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true","settingValueTemplateReference":{"settingValueTemplateId":"c38694c7-51a4-4a35-8f64-b10866a04776","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_publicprofile_logfilepath","settingInstanceTemplateReference":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationStringSettingValue","value":"%SystemRoot%\\System32\\logfiles\\firewall\\publicfw.log","settingValueTemplateReference":{"settingValueTemplateId":"c38694c7-51a4-4a35-8f64-b10866a04776","useTemplateDefault":false}}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_publicprofile_logmaxfilesize","settingInstanceTemplateReference":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue","value":16384,"settingValueTemplateReference":{"settingValueTemplateId":"c38694c7-51a4-4a35-8f64-b10866a04776","useTemplateDefault":false}}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge_false","settingValueTemplateReference":{"settingValueTemplateId":"c38694c7-51a4-4a35-8f64-b10866a04776","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge_false","settingValueTemplateReference":{"settingValueTemplateId":"c38694c7-51a4-4a35-8f64-b10866a04776","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_publicprofile_authappsallowuserprefmerge","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_publicprofile_authappsallowuserprefmerge_false","settingValueTemplateReference":{"settingValueTemplateId":"c38694c7-51a4-4a35-8f64-b10866a04776","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction_1","settingValueTemplateReference":{"settingValueTemplateId":"c38694c7-51a4-4a35-8f64-b10866a04776","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_publicprofile_defaultoutboundaction","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_publicprofile_defaultoutboundaction_0","settingValueTemplateReference":{"settingValueTemplateId":"c38694c7-51a4-4a35-8f64-b10866a04776","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_publicprofile_disableinboundnotifications","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_publicprofile_disableinboundnotifications_true","settingValueTemplateReference":{"settingValueTemplateId":"c38694c7-51a4-4a35-8f64-b10866a04776","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode_true","settingValueTemplateReference":{"settingValueTemplateId":"c38694c7-51a4-4a35-8f64-b10866a04776","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmodeipsecsecuredpacketexemption","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmodeipsecsecuredpacketexemption_true","settingValueTemplateReference":{"settingValueTemplateId":"c38694c7-51a4-4a35-8f64-b10866a04776","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast_true","settingValueTemplateReference":{"settingValueTemplateId":"c38694c7-51a4-4a35-8f64-b10866a04776","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_publicprofile_enablelogdroppedpackets","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_publicprofile_enablelogdroppedpackets_true","settingValueTemplateReference":{"settingValueTemplateId":"c38694c7-51a4-4a35-8f64-b10866a04776","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_publicprofile_enablelogignoredrules","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_publicprofile_enablelogignoredrules_true","settingValueTemplateReference":{"settingValueTemplateId":"c38694c7-51a4-4a35-8f64-b10866a04776","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_publicprofile_enablelogsuccessconnections","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_publicprofile_enablelogsuccessconnections_true","settingValueTemplateReference":{"settingValueTemplateId":"c38694c7-51a4-4a35-8f64-b10866a04776","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_publicprofile_globalportsallowuserprefmerge","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_publicprofile_globalportsallowuserprefmerge_false","settingValueTemplateReference":{"settingValueTemplateId":"c38694c7-51a4-4a35-8f64-b10866a04776","useTemplateDefault":false},"children":[]}}]}}},{"id":"3","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}","settingInstanceTemplateReference":{"settingInstanceTemplateId":"24805bd4-1133-4790-82ae-4caa63e16aa6"},"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_target","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_target_wsl","children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_allowhostpolicymerge","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_allowhostpolicymerge_false","settingValueTemplateReference":{"settingValueTemplateId":"08d59ff0-47ad-4bf2-8479-84c119600805","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_domainprofile_enablefirewall","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_domainprofile_enablefirewall_true","settingValueTemplateReference":{"settingValueTemplateId":"08d59ff0-47ad-4bf2-8479-84c119600805","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_domainprofile_allowlocalpolicymerge","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_domainprofile_allowlocalpolicymerge_false","settingValueTemplateReference":{"settingValueTemplateId":"08d59ff0-47ad-4bf2-8479-84c119600805","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_domainprofile_defaultinboundaction","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_domainprofile_defaultinboundaction_1","settingValueTemplateReference":{"settingValueTemplateId":"08d59ff0-47ad-4bf2-8479-84c119600805","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_domainprofile_defaultoutboundaction","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_domainprofile_defaultoutboundaction_0","settingValueTemplateReference":{"settingValueTemplateId":"08d59ff0-47ad-4bf2-8479-84c119600805","useTemplateDefault":false},"children":[]}}]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_enableloopback","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_enableloopback_false","settingValueTemplateReference":{"settingValueTemplateId":"08d59ff0-47ad-4bf2-8479-84c119600805","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_privateprofile_enablefirewall","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_privateprofile_enablefirewall_true","settingValueTemplateReference":{"settingValueTemplateId":"08d59ff0-47ad-4bf2-8479-84c119600805","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_privateprofile_allowlocalpolicymerge","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_privateprofile_allowlocalpolicymerge_false","settingValueTemplateReference":{"settingValueTemplateId":"08d59ff0-47ad-4bf2-8479-84c119600805","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_privateprofile_defaultinboundaction","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_privateprofile_defaultinboundaction_1","settingValueTemplateReference":{"settingValueTemplateId":"08d59ff0-47ad-4bf2-8479-84c119600805","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_privateprofile_defaultoutboundaction","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_privateprofile_defaultoutboundaction_0","settingValueTemplateReference":{"settingValueTemplateId":"08d59ff0-47ad-4bf2-8479-84c119600805","useTemplateDefault":false},"children":[]}}]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_publicprofile_enablefirewall","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_publicprofile_enablefirewall_true","settingValueTemplateReference":{"settingValueTemplateId":"08d59ff0-47ad-4bf2-8479-84c119600805","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_publicprofile_allowlocalpolicymerge","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_publicprofile_allowlocalpolicymerge_false","settingValueTemplateReference":{"settingValueTemplateId":"08d59ff0-47ad-4bf2-8479-84c119600805","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_publicprofile_defaultinboundaction","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_publicprofile_defaultinboundaction_1","settingValueTemplateReference":{"settingValueTemplateId":"08d59ff0-47ad-4bf2-8479-84c119600805","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_publicprofile_defaultoutboundaction","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_publicprofile_defaultoutboundaction_0","settingValueTemplateReference":{"settingValueTemplateId":"08d59ff0-47ad-4bf2-8479-84c119600805","useTemplateDefault":false},"children":[]}}]}}]}}]}]}},{"id":"4","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_audit_objectaccess_auditfilteringplatformconnection","settingInstanceTemplateReference":{"settingInstanceTemplateId":"be9453a7-6348-4112-a49e-ad029d5d3548"},"choiceSettingValue":{"value":"device_vendor_msft_policy_config_audit_objectaccess_auditfilteringplatformconnection_3","settingValueTemplateReference":{"settingValueTemplateId":"f5e48ffe-d924-4ee1-a1a1-677e259952fa","useTemplateDefault":false},"children":[]}}},{"id":"5","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_audit_objectaccess_auditfilteringplatformpacketdrop","settingInstanceTemplateReference":{"settingInstanceTemplateId":"43f5366a-7e27-47a9-be51-d14189d02a17"},"choiceSettingValue":{"value":"device_vendor_msft_policy_config_audit_objectaccess_auditfilteringplatformpacketdrop_3","settingValueTemplateReference":{"settingValueTemplateId":"bf48ef86-73e5-4a66-a693-24ff8e4be799","useTemplateDefault":false},"children":[]}}}]}