{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(assignments())/$entity",
  "@odata.type": "#microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration",
  "@odata.id": "deviceManagement/deviceConfigurations('30f720f5-5a06-4911-942f-4f7e8d2ea272')",
  "@odata.editLink": "deviceManagement/deviceConfigurations('30f720f5-5a06-4911-942f-4f7e8d2ea272')/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration",
  "id": "30f720f5-5a06-4911-942f-4f7e8d2ea272",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-03-18T13:43:21.8855892Z",
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "supportsScopeTags": true,
  "deviceManagementApplicabilityRuleOsEdition": null,
  "deviceManagementApplicabilityRuleOsVersion": null,
  "deviceManagementApplicabilityRuleDeviceMode": null,
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2025-03-18T13:43:21.8855892Z",
  "description": "This Policy sets Android fully managed Device Restrictions.",
  "displayName": "Android-fully_managed_Settings",
  "version": 1,
  "accountsBlockModification": true,
  "appsAllowInstallFromUnknownSources": null,
  "appsAutoUpdatePolicy@odata.type": "#microsoft.graph.androidDeviceOwnerAppAutoUpdatePolicyType",
  "appsAutoUpdatePolicy": "always",
  "appsDefaultPermissionPolicy@odata.type": "#microsoft.graph.androidDeviceOwnerDefaultAppPermissionPolicyType",
  "appsDefaultPermissionPolicy": "autoGrant",
  "appsRecommendSkippingFirstUseHints": null,
  "bluetoothBlockConfiguration": null,
  "bluetoothBlockContactSharing": true,
  "cameraBlocked": null,
  "cellularBlockWiFiTethering": null,
  "certificateCredentialConfigurationDisabled": true,
  "crossProfilePoliciesAllowCopyPaste": null,
  "crossProfilePoliciesAllowDataSharing@odata.type": "#microsoft.graph.androidDeviceOwnerCrossProfileDataSharing",
  "crossProfilePoliciesAllowDataSharing": "dataSharingFromWorkToPersonalBlocked",
  "crossProfilePoliciesShowWorkContactsInPersonalProfile": null,
  "microsoftLauncherConfigurationEnabled": true,
  "microsoftLauncherCustomWallpaperEnabled": null,
  "microsoftLauncherCustomWallpaperImageUrl": null,
  "microsoftLauncherCustomWallpaperAllowUserModification": null,
  "microsoftLauncherFeedEnabled": true,
  "microsoftLauncherFeedAllowUserModification": true,
  "microsoftLauncherDockPresenceConfiguration@odata.type": "#microsoft.graph.microsoftLauncherDockPresence",
  "microsoftLauncherDockPresenceConfiguration": "show",
  "microsoftLauncherDockPresenceAllowUserModification": true,
  "microsoftLauncherSearchBarPlacementConfiguration@odata.type": "#microsoft.graph.microsoftLauncherSearchBarPlacement",
  "microsoftLauncherSearchBarPlacementConfiguration": "bottom",
  "enrollmentProfile@odata.type": "#microsoft.graph.androidDeviceOwnerEnrollmentProfileType",
  "enrollmentProfile": "fullyManaged",
  "dataRoamingBlocked": null,
  "dateTimeConfigurationBlocked": true,
  "detailedHelpText": null,
  "deviceOwnerLockScreenMessage": null,
  "securityCommonCriteriaModeEnabled": null,
  "factoryResetDeviceAdministratorEmails@odata.type": "#Collection(String)",
  "factoryResetDeviceAdministratorEmails": [
    "testadmin@gmail.com"
  ],
  "factoryResetBlocked": true,
  "globalProxy": null,
  "googleAccountsBlocked": null,
  "kioskCustomizationDeviceSettingsBlocked": null,
  "kioskCustomizationPowerButtonActionsBlocked": null,
  "kioskCustomizationStatusBar@odata.type": "#microsoft.graph.androidDeviceOwnerKioskCustomizationStatusBar",
  "kioskCustomizationStatusBar": "notConfigured",
  "kioskCustomizationSystemErrorWarnings": null,
  "kioskCustomizationSystemNavigation@odata.type": "#microsoft.graph.androidDeviceOwnerKioskCustomizationSystemNavigation",
  "kioskCustomizationSystemNavigation": "notConfigured",
  "kioskModeScreenSaverConfigurationEnabled": null,
  "kioskModeScreenSaverImageUrl": null,
  "kioskModeScreenSaverDisplayTimeInSeconds": null,
  "kioskModeScreenSaverStartDelayInSeconds": null,
  "kioskModeScreenSaverDetectMediaDisabled": null,
  "kioskModeWallpaperUrl": null,
  "kioskModeExitCode": null,
  "kioskModeVirtualHomeButtonEnabled": null,
  "kioskModeVirtualHomeButtonType@odata.type": "#microsoft.graph.androidDeviceOwnerVirtualHomeButtonType",
  "kioskModeVirtualHomeButtonType": "notConfigured",
  "kioskModeBluetoothConfigurationEnabled": null,
  "kioskModeWiFiConfigurationEnabled": null,
  "kioskModeFlashlightConfigurationEnabled": null,
  "kioskModeMediaVolumeConfigurationEnabled": null,
  "kioskModeShowDeviceInfo": null,
  "kioskModeManagedSettingsEntryDisabled": null,
  "kioskModeDebugMenuEasyAccessEnabled": null,
  "kioskModeShowAppNotificationBadge": null,
  "kioskModeScreenOrientation@odata.type": "#microsoft.graph.androidDeviceOwnerKioskModeScreenOrientation",
  "kioskModeScreenOrientation": "notConfigured",
  "kioskModeIconSize@odata.type": "#microsoft.graph.androidDeviceOwnerKioskModeIconSize",
  "kioskModeIconSize": "notConfigured",
  "kioskModeFolderIcon@odata.type": "#microsoft.graph.androidDeviceOwnerKioskModeFolderIcon",
  "kioskModeFolderIcon": "notConfigured",
  "kioskModeWifiAllowedSsids@odata.type": "#Collection(String)",
  "kioskModeWifiAllowedSsids": [],
  "kioskModeAppOrderEnabled": null,
  "kioskModeAppsInFolderOrderedByName": null,
  "kioskModeGridHeight": null,
  "kioskModeGridWidth": null,
  "kioskModeLockHomeScreen": null,
  "kioskModeManagedHomeScreenAutoSignout": null,
  "kioskModeManagedHomeScreenInactiveSignOutDelayInSeconds": null,
  "kioskModeManagedHomeScreenInactiveSignOutNoticeInSeconds": null,
  "kioskModeManagedHomeScreenPinComplexity": null,
  "kioskModeManagedHomeScreenPinRequired": null,
  "kioskModeManagedHomeScreenPinRequiredToResume": null,
  "kioskModeManagedHomeScreenSignInBackground": null,
  "kioskModeManagedHomeScreenSignInBrandingLogo": null,
  "kioskModeManagedHomeScreenSignInEnabled": null,
  "kioskModeUseManagedHomeScreenApp@odata.type": "#microsoft.graph.kioskModeType",
  "kioskModeUseManagedHomeScreenApp": "notConfigured",
  "microphoneForceMute": null,
  "networkEscapeHatchAllowed": null,
  "nfcBlockOutgoingBeam": true,
  "passwordBlockKeyguard": null,
  "passwordBlockKeyguardFeatures@odata.type": "#Collection(microsoft.graph.androidKeyguardFeature)",
  "passwordBlockKeyguardFeatures": [
    "unredactedNotifications"
  ],
  "passwordExpirationDays": 180,
  "passwordMinimumLength": null,
  "passwordMinimumLetterCharacters": null,
  "passwordMinimumLowerCaseCharacters": null,
  "passwordMinimumNonLetterCharacters": null,
  "passwordMinimumNumericCharacters": null,
  "passwordMinimumSymbolCharacters": null,
  "passwordMinimumUpperCaseCharacters": null,
  "passwordMinutesOfInactivityBeforeScreenTimeout": 5,
  "passwordPreviousPasswordCountToBlock": 10,
  "passwordRequiredType@odata.type": "#microsoft.graph.androidDeviceOwnerRequiredPasswordType",
  "passwordRequiredType": "required",
  "passwordRequireUnlock@odata.type": "#microsoft.graph.androidDeviceOwnerRequiredPasswordUnlock",
  "passwordRequireUnlock": "deviceDefault",
  "passwordSignInFailureCountBeforeFactoryReset": 10,
  "playStoreMode@odata.type": "#microsoft.graph.androidDeviceOwnerPlayStoreMode",
  "playStoreMode": "allowList",
  "screenCaptureBlocked": null,
  "securityDeveloperSettingsEnabled": false,
  "securityRequireVerifyApps": true,
  "shortHelpText": null,
  "statusBarBlocked": null,
  "stayOnModes@odata.type": "#Collection(microsoft.graph.androidDeviceOwnerBatteryPluggedMode)",
  "stayOnModes": [],
  "storageAllowUsb": true,
  "storageBlockExternalMedia": true,
  "storageBlockUsbFileTransfer": true,
  "systemUpdateWindowStartMinutesAfterMidnight": null,
  "systemUpdateWindowEndMinutesAfterMidnight": null,
  "systemUpdateInstallType@odata.type": "#microsoft.graph.androidDeviceOwnerSystemUpdateInstallType",
  "systemUpdateInstallType": "automatic",
  "systemWindowsBlocked": null,
  "usersBlockAdd": null,
  "usersBlockRemove": true,
  "volumeBlockAdjustment": null,
  "vpnAlwaysOnLockdownMode": false,
  "vpnAlwaysOnPackageIdentifier": "",
  "wifiBlockEditConfigurations": null,
  "wifiBlockEditPolicyDefinedConfigurations": null,
  "personalProfileAppsAllowInstallFromUnknownSources": null,
  "personalProfileCameraBlocked": null,
  "personalProfileScreenCaptureBlocked": null,
  "personalProfilePlayStoreMode@odata.type": "#microsoft.graph.personalProfilePersonalPlayStoreMode",
  "personalProfilePlayStoreMode": "notConfigured",
  "workProfilePasswordExpirationDays": 180,
  "workProfilePasswordMinimumLength": null,
  "workProfilePasswordMinimumNumericCharacters": null,
  "workProfilePasswordMinimumNonLetterCharacters": null,
  "workProfilePasswordMinimumLetterCharacters": null,
  "workProfilePasswordMinimumLowerCaseCharacters": null,
  "workProfilePasswordMinimumUpperCaseCharacters": null,
  "workProfilePasswordMinimumSymbolCharacters": null,
  "workProfilePasswordPreviousPasswordCountToBlock": 10,
  "workProfilePasswordSignInFailureCountBeforeFactoryReset": 10,
  "workProfilePasswordRequiredType@odata.type": "#microsoft.graph.androidDeviceOwnerRequiredPasswordType",
  "workProfilePasswordRequiredType": "required",
  "workProfilePasswordRequireUnlock@odata.type": "#microsoft.graph.androidDeviceOwnerRequiredPasswordUnlock",
  "workProfilePasswordRequireUnlock": "deviceDefault",
  "locateDeviceUserlessDisabled": true,
  "locateDeviceLostModeEnabled": false,
  "shareDeviceLocationDisabled": null,
  "deviceLocationMode": null,
  "azureAdSharedDeviceDataClearApps@odata.type": "#Collection(microsoft.graph.appListItem)",
  "azureAdSharedDeviceDataClearApps": [],
  "kioskModeApps@odata.type": "#Collection(microsoft.graph.appListItem)",
  "kioskModeApps": [],
  "kioskModeManagedFolders@odata.type": "#Collection(microsoft.graph.androidDeviceOwnerKioskModeManagedFolder)",
  "kioskModeManagedFolders": [],
  "kioskModeAppPositions@odata.type": "#Collection(microsoft.graph.androidDeviceOwnerKioskModeAppPositionItem)",
  "kioskModeAppPositions": [],
  "systemUpdateFreezePeriods@odata.type": "#Collection(microsoft.graph.androidDeviceOwnerSystemUpdateFreezePeriod)",
  "systemUpdateFreezePeriods": [],
  "personalProfilePersonalApplications@odata.type": "#Collection(microsoft.graph.appListItem)",
  "personalProfilePersonalApplications": [],
  "androidDeviceOwnerDelegatedScopeAppSettings@odata.type": "#Collection(microsoft.graph.androidDeviceOwnerDelegatedScopeAppSetting)",
  "androidDeviceOwnerDelegatedScopeAppSettings": [],
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('30f720f5-5a06-4911-942f-4f7e8d2ea272')/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('30f720f5-5a06-4911-942f-4f7e8d2ea272')/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('30f720f5-5a06-4911-942f-4f7e8d2ea272')/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/assignments",
  "assignments": [],
  "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('30f720f5-5a06-4911-942f-4f7e8d2ea272')/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/deviceSettingStateSummaries/$ref",
  "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('30f720f5-5a06-4911-942f-4f7e8d2ea272')/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/deviceSettingStateSummaries",
  "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('30f720f5-5a06-4911-942f-4f7e8d2ea272')/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/deviceStatuses/$ref",
  "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('30f720f5-5a06-4911-942f-4f7e8d2ea272')/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/deviceStatuses",
  "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('30f720f5-5a06-4911-942f-4f7e8d2ea272')/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/deviceStatusOverview/$ref",
  "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('30f720f5-5a06-4911-942f-4f7e8d2ea272')/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/deviceStatusOverview",
  "groupAssignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('30f720f5-5a06-4911-942f-4f7e8d2ea272')/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/groupAssignments/$ref",
  "groupAssignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('30f720f5-5a06-4911-942f-4f7e8d2ea272')/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/groupAssignments",
  "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('30f720f5-5a06-4911-942f-4f7e8d2ea272')/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/userStatuses/$ref",
  "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('30f720f5-5a06-4911-942f-4f7e8d2ea272')/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/userStatuses",
  "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('30f720f5-5a06-4911-942f-4f7e8d2ea272')/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/userStatusOverview/$ref",
  "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('30f720f5-5a06-4911-942f-4f7e8d2ea272')/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/userStatusOverview",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('30f720f5-5a06-4911-942f-4f7e8d2ea272')/microsoft.graph.deviceConfiguration/microsoft.graph.assign"
  },
  "#microsoft.graph.assignedAccessMultiModeProfiles": {
    "title": "microsoft.graph.assignedAccessMultiModeProfiles",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('30f720f5-5a06-4911-942f-4f7e8d2ea272')/microsoft.graph.deviceConfiguration/microsoft.graph.assignedAccessMultiModeProfiles"
  },
  "#microsoft.graph.windowsPrivacyAccessControls": {
    "title": "microsoft.graph.windowsPrivacyAccessControls",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('30f720f5-5a06-4911-942f-4f7e8d2ea272')/microsoft.graph.deviceConfiguration/microsoft.graph.windowsPrivacyAccessControls"
  },
  "#microsoft.graph.getOmaSettingPlainTextValue": {
    "title": "microsoft.graph.getOmaSettingPlainTextValue",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('30f720f5-5a06-4911-942f-4f7e8d2ea272')/microsoft.graph.deviceConfiguration/microsoft.graph.getOmaSettingPlainTextValue"
  }
}
