{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(assignments())/$entity",
  "@odata.type": "#microsoft.graph.androidWorkProfileGeneralDeviceConfiguration",
  "@odata.id": "deviceManagement/deviceConfigurations('0a588de6-1c12-405f-8f65-235a0b50ebaf')",
  "@odata.editLink": "deviceManagement/deviceConfigurations('0a588de6-1c12-405f-8f65-235a0b50ebaf')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration",
  "id": "0a588de6-1c12-405f-8f65-235a0b50ebaf",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-03-18T13:28:56.9739687Z",
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "supportsScopeTags": true,
  "deviceManagementApplicabilityRuleOsEdition": null,
  "deviceManagementApplicabilityRuleOsVersion": null,
  "deviceManagementApplicabilityRuleDeviceMode": null,
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2025-03-18T13:22:28.6822784Z",
  "description": "This Policy sets Android Work Profile Settings.",
  "displayName": "Android-Work_Profile_Settings",
  "version": 2,
  "passwordBlockFaceUnlock": false,
  "passwordBlockFingerprintUnlock": false,
  "passwordBlockIrisUnlock": false,
  "passwordBlockTrustAgents": false,
  "passwordExpirationDays": null,
  "passwordMinimumLength": null,
  "passwordMinutesOfInactivityBeforeScreenTimeout": null,
  "passwordPreviousPasswordBlockCount": null,
  "passwordSignInFailureCountBeforeFactoryReset": null,
  "passwordRequiredType@odata.type": "#microsoft.graph.androidWorkProfileRequiredPasswordType",
  "passwordRequiredType": "atLeastNumeric",
  "requiredPasswordComplexity@odata.type": "#microsoft.graph.androidRequiredPasswordComplexity",
  "requiredPasswordComplexity": "none",
  "workProfileAllowAppInstallsFromUnknownSources": false,
  "workProfileDataSharingType@odata.type": "#microsoft.graph.androidWorkProfileCrossProfileDataSharingType",
  "workProfileDataSharingType": "deviceDefault",
  "workProfileBlockNotificationsWhileDeviceLocked": false,
  "workProfileBlockAddingAccounts": true,
  "workProfileBluetoothEnableContactSharing": false,
  "workProfileBlockScreenCapture": false,
  "workProfileBlockCrossProfileCallerId": false,
  "workProfileBlockCamera": false,
  "workProfileBlockCrossProfileContactsSearch": true,
  "workProfileBlockCrossProfileCopyPaste": true,
  "workProfileDefaultAppPermissionPolicy@odata.type": "#microsoft.graph.androidWorkProfileDefaultAppPermissionPolicyType",
  "workProfileDefaultAppPermissionPolicy": "autoGrant",
  "workProfilePasswordBlockFaceUnlock": false,
  "workProfilePasswordBlockFingerprintUnlock": false,
  "workProfilePasswordBlockIrisUnlock": false,
  "workProfilePasswordBlockTrustAgents": false,
  "workProfilePasswordExpirationDays": 30,
  "workProfilePasswordMinimumLength": 6,
  "workProfilePasswordMinNumericCharacters": null,
  "workProfilePasswordMinNonLetterCharacters": null,
  "workProfilePasswordMinLetterCharacters": null,
  "workProfilePasswordMinLowerCaseCharacters": null,
  "workProfilePasswordMinUpperCaseCharacters": null,
  "workProfilePasswordMinSymbolCharacters": null,
  "workProfilePasswordMinutesOfInactivityBeforeScreenTimeout": 5,
  "workProfilePasswordPreviousPasswordBlockCount": 5,
  "workProfilePasswordSignInFailureCountBeforeFactoryReset": 10,
  "workProfilePasswordRequiredType@odata.type": "#microsoft.graph.androidWorkProfileRequiredPasswordType",
  "workProfilePasswordRequiredType": "required",
  "workProfileRequiredPasswordComplexity@odata.type": "#microsoft.graph.androidRequiredPasswordComplexity",
  "workProfileRequiredPasswordComplexity": "medium",
  "workProfileRequirePassword": true,
  "securityRequireVerifyApps": true,
  "vpnAlwaysOnPackageIdentifier": "",
  "vpnEnableAlwaysOnLockdownMode": false,
  "workProfileAllowWidgets": false,
  "workProfileBlockPersonalAppInstallsFromUnknownSources": false,
  "workProfileAccountUse@odata.type": "#microsoft.graph.androidWorkProfileAccountUse",
  "workProfileAccountUse": "blockAll",
  "allowedGoogleAccountDomains@odata.type": "#Collection(String)",
  "allowedGoogleAccountDomains": [],
  "blockUnifiedPasswordForWorkProfile": true,
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('0a588de6-1c12-405f-8f65-235a0b50ebaf')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('0a588de6-1c12-405f-8f65-235a0b50ebaf')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('0a588de6-1c12-405f-8f65-235a0b50ebaf')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/assignments",
  "assignments": [],
  "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('0a588de6-1c12-405f-8f65-235a0b50ebaf')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/deviceSettingStateSummaries/$ref",
  "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('0a588de6-1c12-405f-8f65-235a0b50ebaf')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/deviceSettingStateSummaries",
  "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('0a588de6-1c12-405f-8f65-235a0b50ebaf')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/deviceStatuses/$ref",
  "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('0a588de6-1c12-405f-8f65-235a0b50ebaf')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/deviceStatuses",
  "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('0a588de6-1c12-405f-8f65-235a0b50ebaf')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/deviceStatusOverview/$ref",
  "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('0a588de6-1c12-405f-8f65-235a0b50ebaf')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/deviceStatusOverview",
  "groupAssignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('0a588de6-1c12-405f-8f65-235a0b50ebaf')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/groupAssignments/$ref",
  "groupAssignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('0a588de6-1c12-405f-8f65-235a0b50ebaf')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/groupAssignments",
  "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('0a588de6-1c12-405f-8f65-235a0b50ebaf')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/userStatuses/$ref",
  "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('0a588de6-1c12-405f-8f65-235a0b50ebaf')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/userStatuses",
  "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('0a588de6-1c12-405f-8f65-235a0b50ebaf')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/userStatusOverview/$ref",
  "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('0a588de6-1c12-405f-8f65-235a0b50ebaf')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/userStatusOverview",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('0a588de6-1c12-405f-8f65-235a0b50ebaf')/microsoft.graph.deviceConfiguration/microsoft.graph.assign"
  },
  "#microsoft.graph.assignedAccessMultiModeProfiles": {
    "title": "microsoft.graph.assignedAccessMultiModeProfiles",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('0a588de6-1c12-405f-8f65-235a0b50ebaf')/microsoft.graph.deviceConfiguration/microsoft.graph.assignedAccessMultiModeProfiles"
  },
  "#microsoft.graph.windowsPrivacyAccessControls": {
    "title": "microsoft.graph.windowsPrivacyAccessControls",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('0a588de6-1c12-405f-8f65-235a0b50ebaf')/microsoft.graph.deviceConfiguration/microsoft.graph.windowsPrivacyAccessControls"
  },
  "#microsoft.graph.getOmaSettingPlainTextValue": {
    "title": "microsoft.graph.getOmaSettingPlainTextValue",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('0a588de6-1c12-405f-8f65-235a0b50ebaf')/microsoft.graph.deviceConfiguration/microsoft.graph.getOmaSettingPlainTextValue"
  }
}
